README.org
* README

* ~local.el~
  We define a ~local.el~ to store local links

  - Do not expect ~local.el~ to exist all the time
  - Do not expect ~local.el~ to define a consistent set of variables
  - Expect ~local.el~ to vary wildly in content throughout different machines
  - Basically don't trust ~local.el~. It is a necessary evil

** Known Variables
   These variabes have been known to exist at some point

   - /g-drive-folder :: const
        The path to the local google drive folder, We use this
        mostly so we can sync our org-journal and ledger files
